<template><div><h2 id="技术面" tabindex="-1"><a class="header-anchor" href="#技术面"><span>技术面</span></a></h2>
<h3 id="自我介绍" tabindex="-1"><a class="header-anchor" href="#自我介绍"><span>自我介绍</span></a></h3>
<p>面试官您好，我是来自曲阜师范大学的王文鹏，我想要面试的是Java开发工程师。</p>
<p>有 Spring boot Sping MCV 等主流技术构造单体架构的应用等经验，并且也具备一定的使用Sring Cloud Alibaba 开发微服务项目的能力。能够按时独立完成自己的工作。在项目里我用过用索引和执行计划等进行过数据库调优，以及针对某些场景使用线程池和消息队列等技术进行过性能优化。</p>
<h3 id="项目是独立完成的" tabindex="-1"><a class="header-anchor" href="#项目是独立完成的"><span>项目是独立完成的？</span></a></h3>
<p>对的，第一个项目是在工作期间参与的。</p>
<h3 id="项目周期多久" tabindex="-1"><a class="header-anchor" href="#项目周期多久"><span>项目周期多久</span></a></h3>
<p>项目周期大概半年。</p>
<h3 id="项目上线了嘛" tabindex="-1"><a class="header-anchor" href="#项目上线了嘛"><span>项目上线了嘛？</span></a></h3>
<p>我当时主要参与的是开发工作，项目后续的部署上线我不是很清楚。这块是由运维做的。</p>
<h2 id="hr-面" tabindex="-1"><a class="header-anchor" href="#hr-面"><span>HR 面</span></a></h2>
<h3 id="自我介绍-1" tabindex="-1"><a class="header-anchor" href="#自我介绍-1"><span>自我介绍</span></a></h3>
<p>面试官您好，我是来自曲阜师范大学的王文鹏，我想要面试的是 Java 开发工程师。
除了具备开发技能之外，我还有良好的合作、沟通汇报意识。并且在 AI 大浪潮之下，继续积极拥抱 AI，积极使用 AI 探索更多可能性，提高个人效率，为公司创造更多的效益，同时也是实现自我成长。</p>
<h3 id="为什么应聘这个岗位" tabindex="-1"><a class="header-anchor" href="#为什么应聘这个岗位"><span>为什么应聘这个岗位</span></a></h3>
<p>从大学的时候就很喜欢编程，当时就动手写了一些自动化小工具，后来又接触到 Java，逐渐喜欢上了用 Java 来开发项目。所以我的兴趣、经历都和贵公司的岗位比较匹配。同时贵公司的 java 开发的前景广阔，我认为我可以为贵公司带来一些新的价值。</p>
<h3 id="说说你的优势" tabindex="-1"><a class="header-anchor" href="#说说你的优势"><span>说说你的优势？</span></a></h3>
<p>我系统化的学过现在的主流技术栈，同时也有做为核心成员的项目开发经验。能独立完成开发的任务。同时还比较注重代码的质量，遇到不会的问题也会先自己搜寻一下资料，再去请教。</p>
<h3 id="说说你的职业规划" tabindex="-1"><a class="header-anchor" href="#说说你的职业规划"><span>说说你的职业规划</span></a></h3>
<ul>
<li>在转正之前的计划是快速熟悉公司的业务，了解公司的文化，拉进与同事们之间的关系，快速融入公司。</li>
<li>在转之后转正之后，我会继续向公司们的同事积极学习，先把公司这一套东西懂弄明白。</li>
<li>至于更长远一点的计划，我计划的是三年内的规划是做成一个懂安全的高级开发工程师。当然我也会根据公司的发展来动态的调整。</li>
</ul>
<h3 id="说说你没有被录取的原因" tabindex="-1"><a class="header-anchor" href="#说说你没有被录取的原因"><span>说说你没有被录取的原因</span></a></h3>
<ul>
<li>我太重视这次面试，可能表现的有些紧张，</li>
<li>可能我掌握的技能不太匹配岗位的要求，</li>
<li>但是，我也会积极努力，如果被贵公司录取，我会积极学习，快速补齐短板。哪怕没有被录取，继续完善自己的技能，继续加油。</li>
</ul>
<h3 id="你当时为什么没参加秋招-秋招没找工作吗" tabindex="-1"><a class="header-anchor" href="#你当时为什么没参加秋招-秋招没找工作吗"><span>你当时为什么没参加秋招，秋招没找工作吗</span></a></h3>
<p>当时是在准备考研来，所以就错过了。但是后来我也没放弃，然后持续的学习 Java 相关技术栈，不断提示自己。</p>
<h3 id="你比较看重公司的什么" tabindex="-1"><a class="header-anchor" href="#你比较看重公司的什么"><span>你比较看重公司的什么</span></a></h3>
<ul>
<li>我个人最看重的是公司的氛围、文化、价值观。</li>
<li>很多同学都说发展前景，但是我认为无论是哪个公司都会有波澜起伏的的时候，但是假如一个公司拥有良好的价值观、文化、氛围，无论前景现在如何，都能一如即往的前进。同时加入我有幸加入贵公司，我也会积极的为公司带来更多的正能量。</li>
</ul>
<h3 id="你为什么来这个城市-公司工作" tabindex="-1"><a class="header-anchor" href="#你为什么来这个城市-公司工作"><span>你为什么来这个城市/公司工作</span></a></h3>
<p>公司：主要是贵公司的企业文化和价值观我非常喜欢，希望能加入融入这个大家庭，为这个大家庭贡献力量。
城市：这是一个充满底蕴、文化的、开放的城市，我非常喜欢在这边生活...</p>
<h3 id="能否接受加班" tabindex="-1"><a class="header-anchor" href="#能否接受加班"><span>能否接受加班</span></a></h3>
<p>我认为加班是可以理解的，互联网变化多端，时常会出现新的风口，必须要紧紧握住机会，同时也在这种机会中实现自我磨练，更快速的成长。</p>
<h3 id="你最大的优点" tabindex="-1"><a class="header-anchor" href="#你最大的优点"><span>你最大的优点</span></a></h3>
<p>我最大的优点就是我是一个阳光乐观具有成长思维的乐观主义的人，我对于自我投资很感兴趣，我觉得入职工作只是成长的起点而不是终点。还得不断提升自己。</p>
<h3 id="你最大的缺点" tabindex="-1"><a class="header-anchor" href="#你最大的缺点"><span>你最大的缺点</span></a></h3>
<ul>
<li>有时候可能稍微有点完美主义倾向，目前正在通过规划任务，排序优先级，积极的改正这个缺点，努力把它变成我的优点，在完成主要任务的时候再进行打磨。</li>
</ul>
<h3 id="两个词三个词形容我自己" tabindex="-1"><a class="header-anchor" href="#两个词三个词形容我自己"><span>两个词三个词形容我自己</span></a></h3>
<ul>
<li>阳光乐观，喜欢运动交友</li>
<li>乐于成长，积极拥抱新技术</li>
</ul>
<h3 id="你能接受出差吗" tabindex="-1"><a class="header-anchor" href="#你能接受出差吗"><span>你能接受出差吗</span></a></h3>
<p>我是可以接受的，这是一个可以迅速提升自己视野的机会，同时也能更好的了解公司的业务和客户。也是和用户直接接触学习的一个好机会。</p>
<h3 id="你考过研吗" tabindex="-1"><a class="header-anchor" href="#你考过研吗"><span>你考过研吗</span></a></h3>
<p>我确实准备过一段时间的考研，虽然当时结果不太如意，虽然这不意味着我在这一年的时间全然无获。感觉那一年还是让我感悟了不少东西的，比如运动啊、做笔记就是那一年养成的习惯。也相信我这些能力可以在日后帮祝我更好的完成的工作中</p>
<h3 id="为什么现在才找工作" tabindex="-1"><a class="header-anchor" href="#为什么现在才找工作"><span>为什么现在才找工作</span></a></h3>
<p>我大学的准备过一段时间的考研，虽然当时结果不太如意，但是也收获了很多。比如运动啊、做笔记就是那一年养成的习惯。然后我又开始学习 Java 这块内容，后来也是在毕业之前找到了工作，但是之前公司业务调整，调整到了我去其它业务线，但是新岗位和我的职业规划不相符，我还是想继续在 Java 方向深耕，所以我离职了。</p>
<p>补充：可以说那个岗位与一些客户端交互更多</p>
<h3 id="你希望的待遇是什么" tabindex="-1"><a class="header-anchor" href="#你希望的待遇是什么"><span>你希望的待遇是什么</span></a></h3>
<p>最低薪资 8.5 k 满意薪资 10 k</p>
<h3 id="你什么时候可以来上班" tabindex="-1"><a class="header-anchor" href="#你什么时候可以来上班"><span>你什么时候可以来上班</span></a></h3>
<p>我一定会尽快的到岗，但是我可能需要 1-2 周的时间，因为我得提前找好房子，并且收拾下东西。但是如果有紧急的事情，我也是可以紧急到岗的，但是后续可能会需要请假几天假。</p>
<h3 id="你的好友如何评价你" tabindex="-1"><a class="header-anchor" href="#你的好友如何评价你"><span>你的好友如何评价你</span></a></h3>
<p>要有具体案例</p>
<h3 id="是否有创业的计划" tabindex="-1"><a class="header-anchor" href="#是否有创业的计划"><span>是否有创业的计划</span></a></h3>
<p>没有，我现在想法就是积极的学习提升自己，勤勤恳恳的和同事们一起完成任务，共同成长</p>
<h3 id="当你确信自己是正确的-但是其他人确不赞同如何解决" tabindex="-1"><a class="header-anchor" href="#当你确信自己是正确的-但是其他人确不赞同如何解决"><span>当你确信自己是正确的，但是其他人确不赞同如何解决</span></a></h3>
<h3 id="谈谈你的家庭" tabindex="-1"><a class="header-anchor" href="#谈谈你的家庭"><span>谈谈你的家庭</span></a></h3>
<p>我的家庭一般，但是父母都比较开明，对于找工作这块也是听我的想法，也很支持我做开发。</p>
<h3 id="人生中最难过的时刻" tabindex="-1"><a class="header-anchor" href="#人生中最难过的时刻"><span>人生中最难过的时刻</span></a></h3>
<p>最难过的就是我一个从大学玩到毕业的同学不在交往了吧，他的负能量太重了，感觉和这种人交朋友也不能一起成长。还是更喜欢和有想法，有能力的人一起共事。</p>
<h3 id="最有成就感的一件事" tabindex="-1"><a class="header-anchor" href="#最有成就感的一件事"><span>最有成就感的一件事</span></a></h3>
<p>最有成就感的事情，还是当时给同学写的一个自动抢图书馆座位的工具，因为感觉到编程很好玩，还能帮到身边的人。</p>
<h3 id="大学成绩如何-高考成绩" tabindex="-1"><a class="header-anchor" href="#大学成绩如何-高考成绩"><span>大学成绩如何/高考成绩</span></a></h3>
<p>大学成绩没有挂科，其中我的编程成绩较为突出，在实训课编程课上都是活跃的那一个，并且当时还喜欢写点自动化工具。</p>
<h3 id="英语水平如何" tabindex="-1"><a class="header-anchor" href="#英语水平如何"><span>英语水平如何</span></a></h3>
<p>通过了 CET-4，可以在不用翻译的情况下基本看懂文档，并且也能使用英文规范的进行变量命名等。</p>
<h3 id="面试了几次-offer-数量" tabindex="-1"><a class="header-anchor" href="#面试了几次-offer-数量"><span>面试了几次/offer 数量</span></a></h3>
<p>我现在才刚开始投</p>
<h3 id="自学能力怎么样" tabindex="-1"><a class="header-anchor" href="#自学能力怎么样"><span>自学能力怎么样</span></a></h3>
<p>我个人觉得我的自学能力还是可以的。当时准备的时候自己跟着文档和视频资源，动手敲出来的几个简单的项目。后来也是上网扒拉一些优秀的项目，通过 debug 的方式学习人家怎么写的。</p>
<h3 id="你对工作地点有要求吗" tabindex="-1"><a class="header-anchor" href="#你对工作地点有要求吗"><span>你对工作地点有要求吗 ？</span></a></h3>
<p>希望在 xxxx</p>
<h3 id="选择一份工作的标准是什么" tabindex="-1"><a class="header-anchor" href="#选择一份工作的标准是什么"><span>选择一份工作的标准是什么</span></a></h3>
<ul>
<li>我觉得是否真的喜欢这个岗位，和认同公司所做的事情吧。还要一个是想要待待公司氛围。</li>
</ul>
<h3 id="需要公司提供哪方面的帮助" tabindex="-1"><a class="header-anchor" href="#需要公司提供哪方面的帮助"><span>需要公司提供哪方面的帮助</span></a></h3>
<ul>
<li>希望提供更多的学习机会，希望以后能为公司独当一面</li>
</ul>
<h3 id="和同事意见不一致怎么办" tabindex="-1"><a class="header-anchor" href="#和同事意见不一致怎么办"><span>和同事意见不一致怎么办</span></a></h3>
<ul>
<li>首先肯定是不能激动，有事好商量。尽量去换位思考一下。然后拿出清晰的理由，互相比对商量</li>
<li>最后如果多次协商无果，我会找其他同事协助我们进行协商。</li>
<li>如果还是不行再和领导汇报，尽量把问题控制在一个最小的范围内解决</li>
</ul>
<h3 id="反问环节" tabindex="-1"><a class="header-anchor" href="#反问环节"><span>反问环节 ？</span></a></h3>
<ul>
<li>咱们公司这个岗位具体是做什么业务的</li>
<li>团队氛围怎么样</li>
</ul>
<h2 id="谈薪注意事项" tabindex="-1"><a class="header-anchor" href="#谈薪注意事项"><span>谈薪注意事项</span></a></h2>
<p>1、好朋友姿态和 HR 交流<br>
2、相信自己如简历一般优秀，即使是白纸也是 A 1 一样足够大的白纸<br>
3、起薪很重要，8 k 和 1 w 起薪 4 年收入差距 10 w</p>
<p>谈薪小妙招<br>
1、薪酬结构：比起基础工资，我更想了解一下公司的薪酬结构，五险一金缴纳的基础是否和工资一样，每个月除了基本工资，是否还有额外的绩效和提成，是否会有加班，加班费如何计算，公司是否有年终奖，年终奖和 KPI 考核机制是怎样的<br>
2、手里有 offer 薪资 8 k，公司业界龙头相信有更高的薪资待遇</p>
<p>①我目前手里有相关行业其他公司的 offer，也是 xx 工作岗位，跟 hr 谈到了 xx 薪资，所以我认为这个薪水是我可以拿得到的。
②贵公司呢也是 xx 行业的技术领跑者，相信能提供的薪酬水平也不会太差。
③另外，综合考虑通勤时间、工作环境等方面的因素，如果贵公司可以提供 xx 薪资，我会更倾向考虑贵公司，希望您可以帮我争取一下，感谢！
【三段法：①我已经有所以我可以有；②夸公司你可以给；③重申需求表达感谢】</p>
</div></template>


