<template><div><h1 id="制定个人愿景" tabindex="-1"><a class="header-anchor" href="#制定个人愿景"><span>制定个人愿景</span></a></h1>
<blockquote>
<p>个人愿景是发自个人内心的，真正最关心的，一生最热切渴望达成的事情，它是一个特定的结果，一种期望的未来或意象。当你为一个自己认为至高无上的目标献上无限心力的时候，它就是一种自然的、发自内心的强大力量。有物质上的欲望；有工作上的成功；有个人的健康、自由、对自己诚实以及家人的幸福；还有对社会方面的贡献；对某领域知识的贡献等等，都是人们心中真正愿望的一部分。</p>
</blockquote>
<ul>
<li>通过创新的硬件、软件和服务为客户提供最佳用户体验 (Apple)</li>
<li>让人类跨行星际 (SpaceX)</li>
<li>建立最以客户为中心的商店，出售一切 (Amazon)</li>
<li>帮助所有梦想和上进心的人们更快地成长和进步 (Vision)</li>
<li>能把我在生活中发现的 idea 转换成产品实现出来带给用户 （某工业设计师小李）</li>
</ul>
<p>例如你的职业是专业开发，你的宏大愿景可以是：尽可能的给用户最佳的使用体验。
可以有具体的愿景，例如你要开发一个租车程序，那我的愿景可以是：真正可上线的商用的汽车租赁小程序。</p>
<p>具体的愿景是在宏大愿景之下的，实现具体愿景的同时，也是在实现那个宏大的愿景中。</p>
<h1 id="" tabindex="-1"><a class="header-anchor" href="#"><span></span></a></h1>
</div></template>


