<template><div><p><a href="http://jyqfnu.sdbys.com/campus/view/id/687287" target="_blank" rel="noopener noreferrer">2024年前程无忧校园合伙人招聘简章</a>
（四）创新中心实习生</p>
<p>1、平面设计实习生（AIGC方向）</p>
<p>应届生请勿投本岗位！本岗位仅面向大二、大三、研一等非应届学生。</p>
<p>工作内容</p>
<p>（1）协助设计师，使用AI相关的创作工具制作主视觉画面，能使用Midjourney、StableDiffusion等AIGC工具制图，对图生图，文字生图有较为深入的研究；</p>
<p>（2）利用AIGC工具可创作不同的风格类型的图片，在参数与关键词调教上有一定的经验；</p>
<p>（3）需要对于AI美术技术领域的动向有足够敏锐度，能及时了解最新的前沿技术和咨询；</p>
<p>（4）具备基础审美能力，可以用PS对AI生成的图片进行修正及SLOGAN设计；</p>
<p>（5）有一定的美术基础，熟练使用AdobePS/AI。</p>
<p>任职要求</p>
<p>（1）设计相关专业在校生，应届生请勿投递本岗位；</p>
<p>（2）具备美术功底及优秀的创意构思能力，良好的沟通和表达能力，学习能力和敬业精神；</p>
<p>（3）一周可以到岗4-5天;能持续实习3个月以上；</p>
<p>（4）应聘请附AIGC相关作品及个人设计作品集。</p>
<p>2、Java后端开发实习生</p>
<p>岗位职责：</p>
<p>（1）负责后端服务的设计、开发、测试和维护，确保系统性能和稳定性；</p>
<p>（2）根据项目需求，完成数据库设计、接口文档编写及API开发；</p>
<p>任职要求：</p>
<p>（1）计算机相关专业本科及以上学历，有实际Java后端开发经验优先；</p>
<p>（2）熟练掌握Java语言，熟悉Spring、SpringBoot、MyBatis、Netty等主流框架；</p>
<p>（3）熟悉MySQL、Redis等数据库技术，有数据库优化经验；</p>
<p>（4）具备良好的编码习惯，熟悉面向对象设计原则，对代码质量和性能有较高要求；</p>
<p>（5）具备优秀的团队协作精神和沟通能力，能够适应快速迭代的项目节奏。</p>
</div></template>


