[
  "obsidian-auto-link-title",
  "oz-clear-unused-images",
  "obsidian-collapse-all-plugin",
  "customizable-menu",
  "obsidian-image-toolkit",
  "obsidian-quiet-outline",
  "better-word-count",
  "obsidian-copy-block-link",
  "obsidian-custom-frames",
  "fuzzy-chinese-pinyin",
  "obsidian-daily-stats",
  "obsidian-paste-image-rename",
  "easy-typing-obsidian",
  "obsidian-export-image",
  "templater-obsidian",
  "cmdr",
  "copilot"
]