<template><div><p>#毕业论文</p>
<p>二、研究的主要内容及预期目标</p>
<p>职员管理；管理员工的基本信息。有助于管理者更能理解职员，可以更清楚职员的难处，防止潜在的沟通隐患。</p>
<p>学生基本信息管理；学生档案、健康信息、家庭背景等方面的管理。有效的学生信息管理可以帮助学校更好地了解每个学生的特点和需求，为个性化教育提供支持。</p>
<p>学生活动管理；涉及到课外活动、兴趣班、校园文化活动等方面的组织和管理。合理规划和管理学生活动，可以拓宽学生的视野，丰富他们的学习经验，促进他们的综合素质发展。</p>
<p>公告信息管理；向家长发布重要的公告和通知。通过有效的公告信息管理，可以确保信息的及时传达和准确性，提高家校沟通的效果。</p>
<p>家校沟通管理；通过家校沟通，了解家长对教育的期望和反馈，以及了解孩子近期家庭情况，及时调整对孩子的关注重心，从而共同关心和支持学生的发展。</p>
<p>表现管理；家长可以通过此模块方便的看到孩子今天有什么良好的表现。</p>
<p>学生个性化兴趣管理；针对学生个体差异和兴趣爱好的管理工作。通过了解学生的兴趣和特长，学校可以提供相应的资源和支持，激发学生的学习动力和发展潜能。</p>
<p>管理员：</p>
<p>个人中心、学校学生管理、职员管理、管理员管理、学校班级管理</p>
<p>职员</p>
<p>个人中心、班级学生管理、班级资产管理、资产损坏管理、交费信息管理、活动管理、表现管理、请假管理模块</p>
<p>宿管员管理公寓资产，缴费信息，公共场所清理信息，日常事务信息，审核学生床位安排信息。</p>
<p>家长端：</p>
<p>孩子个人中心、孩子信息模块、缴费信息模块、活动模块、孩子表现模块、请假模块</p>
<p>修改处：</p>
<ul>
<li>首页不需要学生注册和员工注册，统一由管理员进行录入。</li>
</ul>
<p>管理员：</p>
<ul>
<li>&quot;宿管员管理&quot;修改为&quot;职员管理&quot;</li>
<li>学生管理中增加关于班级的相关操作
<ul>
<li>添加学生时可以给学生指定班级</li>
<li>根据班级筛选</li>
<li>修改学校班级</li>
</ul>
</li>
<li></li>
</ul>
<p>数据库：</p>
<ul>
<li>学生表添加班级列</li>
<li></li>
</ul>
<hr>
<p>前台：幼儿园相关活动，公告信息展示，获奖信息、登入入口、，
后台</p>
<hr>
<h1 id="参考链接" tabindex="-1"><a class="header-anchor" href="#参考链接"><span>参考链接 ：</span></a></h1>
<p><a href="https://www.liaoxuefeng.com/wiki/1252599548343744/1266265175882464" target="_blank" rel="noopener noreferrer">Spring Boot开发 - 廖雪峰的官方网站</a>
<a href="https://zhuanlan.zhihu.com/p/322316709" target="_blank" rel="noopener noreferrer">什么是MVC框架?</a></p>
</div></template>


